###### Installing Pandas
from Command prompt run following command
>pip install pandas

In [1]:
import os
import sys
print(os.path.dirname(sys.executable))

c:\users\halston\appdata\local\programs\python\python38-32

In [2]:
import pandas

In [3]:
df1 = pandas.DataFrame([[2,4,6],[4,16,36]])
df1

   0   1   2
0  2   4   6
1  4  16  36

# you can also pass another two parameters that defines Row Indexes and column names

In [4]:
df1 = pandas.DataFrame([[2,4,6],[4,16,36]],["Number","Square"],["Num 1","Num 2","Num 3"])
df1

        Num 1  Num 2  Num 3
Number      2      4      6
Square      4     16     36

# You can define Columns and Row Indexes with 'columns' & 'index' parameters

In [5]:
df2 = pandas.DataFrame([[2,4,6],[4,16,36]],columns=["Num 1","Num 2","Num 3"],index=["Number","Square"])
df2

        Num 1  Num 2  Num 3
Number      2      4      6
Square      4     16     36

# You Can also pass the "Disctionary" to DataFrame

In [7]:
df3 = pandas.DataFrame([{"Name":"Pramod","Surnam":"Ugale"},{"Name":"Jeffin"}])
df3

     Name Surnam
0  Pramod  Ugale
1  Jeffin    NaN

In [9]:
df1.mean()

Num 1     3.0
Num 2    10.0
Num 3    21.0
dtype: float64

In [10]:
type(df1.mean())

pandas.core.series.Series

# Series are nothing but dictionaries

In [11]:
os.listdir()

['.ipynb_checkpoints',
 'LearningPandas.ipynb',
 'MyPythonLearning.ipynb',
 'supermarkets.json']

In [12]:
type(os.listdir())

list

In [15]:
df_json = pandas.read_json("supermarkets.json")
df_json

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [17]:
df_json.set_index("ID")

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [19]:
df_json.shape

(6, 7)

In [24]:
pandas.read_json?

In [30]:
df_csv = pandas.read_csv("http://pythonhow.com/supermarkets.csv")
df_csv

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [32]:
df_csv_1 = pandas.read_csv("supermarkets_semi_colon.csv")
df_csv_1

        ID;Address;City;State;Country;Name;Employees
0  1;3666 21st St;San Francisco;CA 94114;USA;Made...
1  2;735 Dolores St;San Francisco;CA 94119;USA;Br...
2  3;332 Hill St;San Francisco;California 94114;U...
3  4;3995 23rd St;San Francisco;CA 94114;USA;Ben'...
4  5;1056 Sanchez St;San Francisco;California;USA...
5  6;551 Alvarado St;San Francisco;CA 94114;USA;R...

In [35]:
df_csv_1 = pandas.read_csv("supermarkets_semi_colon.csv",delimiter=';')
df_csv_1

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [34]:
pandas.read_csv?